app/controllers/demo_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def homepage
  	 @user = User.find(params[:id])

SELECT  `users`.* FROM `users` WHERE `users`.`mail` = 'fofo@gmail.com'  ORDER BY `users`.`id` ASC LIMIT 1
---
  def attempt_login
  	if params[:mail].present? && params[:password].present? #feh 7aga hna
      found_user = User.where(:mail => params[:mail]).first

INSERT INTO `users` (`user_name`, `mail`, `password_digest`, `created_at`, `updated_at`) VALUES ('foad', 'fofo@yahoo.com', '$2a$10$I.B3HH8vBYnLAmou4fp9V.3F2wuf0H.25e8JT0ShxwLGV0NVciDxK', '2016-07-18 00:05:52', '2016-07-18 00:05:52')
---
  def create
  	@user = User.new(user_params)
  	if @user.save