app/controllers/user_gpa_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
  def dashboard
  	@user = User.find(params[:user_id])

INSERT INTO `semesters` (`user_id`, `course1`, `course2`, `course3`, `course4`, `course5`, `credit1`, `credit2`, `credit3`, `credit4`, `credit5`, `grade1`, `grade2`, `grade3`, `grade4`, `grade5`, `created_at`, `updated_at`) VALUES (2, 'a', 'xs', 's', 's', 's', 20, 35, 23, 45, 23, '3', '6', '12', '6', '1', '2016-07-18 22:06:36', '2016-07-18 22:06:36')
---
  def calculate
  	#@user = User.find(params[:user_id])
  	@semester = Semester.new(sems_params)
  		if @semester.save

SELECT  `semesters`.* FROM `semesters` WHERE `semesters`.`id` = 18 LIMIT 1
UPDATE `semesters` SET `gpa_result` = 3.2514285714285713, `updated_at` = '2016-07-19 02:14:05' WHERE `semesters`.`id` = 21
---
  def display_gpa
  		@semester = Semester.find(params[:id])
  		  	@credit_sum = @semester.credit1.to_f + @semester.credit2.to_f + @semester.credit3.to_f + @semester.credit4.to_f + @semester.credit5.to_f
  		    @grades_points = (@semester.grade1.to_f*@semester.credit1.to_f)+ (@semester.grade2.to_f*@semester.credit2.to_f) + (@semester.grade3.to_f*@semester.credit3.to_f) + (@semester.grade4.to_f*@semester.credit4.to_f) + (@semester.grade5.to_f*@semester.credit5.to_f)
  		    @semester.gpa_result = @grades_points / @credit_sum
  		    @semester.save